JWXL19733/WeGui_RGB/CW32L012/资料/CW32L012_StandardPeripheralLib_V1.0.1/Examples/VC/vc_detect_fallingRising_irq/USER/src/main.c
/******************************************************************************/
/** \file main.c
 **
 ** A detailed description is available at
 ** @link Sample Group Some description @endlink
 **
 **   - 2021-03-12  1.0  xiebin First version for Device Driver Library of Module.
 **
 ******************************************************************************/
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/
/******************************************************************************
 * Include files
 ******************************************************************************/
#include "../inc/main.h"
#include "cw32l012_vc.h"

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
uint16_t  gFlagIrq = FALSE;
/******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/******************************************************************************
 * Local variable definitions ('static')                                      *
 ******************************************************************************/

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*****************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
void VC_PortInit(void);
void LED_Init(void);
/**
 ******************************************************************************
 ** \brief  Main function of project
 **
 ** \return uint32_t return value, if needed
 **
 **
 **
 ******************************************************************************/
int32_t main(void)
{
    // 系统时钟配置为8MHz
    
    SYSCTRL_HSI_Enable(SYSCTRL_HSIOSC_DIV12);
    VC_InitTypeDef    VC_InitStruct;

    //LED初始化
    LED_Init();
    //配置测试IO口
    VC_PortInit();

    // 初始化 VC 模块
    VC_InitStruct.div  = VC_DIV_3;    // (3+1)/8 = 1/2
    VC_InitStruct.filterConfig.FilterClock = VC_FILTER_CLOCK_PCLK;
    VC_InitStruct.filterConfig.FilterTime  = VC_FILTER_16X_6SAMPLES;
    VC_InitStruct.hysteresisEnable = TRUE;
    VC_InitStruct.inputNegative = VC_INPUT_IN3;    // 内部电阻分压
    VC_InitStruct.inputPositive = VC_INPUT_IN1;    // PA02
    VC_InitStruct.interruptMode = VC_INT_FALLING | VC_INT_RISING;
    VC_InitStruct.polarityInvert = FALSE;
    VC_InitStruct.RefVoltage = VC_REF_AVCC;
    VC_InitStruct.responseSpeed = VC_RESPONSE_SLOW;

    VC_Init(CW_VC1, &VC_InitStruct);
    VC_Cmd(CW_VC1, ENABLE);

    NVIC_EnableIRQ(VC13_IRQn);

    while (1)
    {

    }
}


/**
 * @brief VC I/O初始化
 *
 */
void VC_PortInit(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    __SYSCTRL_GPIOA_CLK_ENABLE();

    //set PA00 as VC1 output
    GPIO_InitStruct.Pins = GPIO_PIN_0;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_Init(CW_GPIOA, &GPIO_InitStruct);

    PA00_AFx_VC1OUT();

    //set PA02 as VC1 Positive input
    PA02_ANALOG_ENABLE();
}

/**
 * @brief LED I/O初始化
 *
 */
void LED_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;
    //打开GPIO时钟

    __SYSCTRL_GPIOB_CLK_ENABLE();
    /* Configure the GPIO_LED pin */
    GPIO_InitStruct.IT = GPIO_IT_NONE;
    GPIO_InitStruct.Pins = GPIO_PIN_9; //LED口为PB09
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_Init(CW_GPIOB, &GPIO_InitStruct);
    //LEDs are off.
    PB09_SETLOW();
}


/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    /* USER CODE END 6 */
}
#endif
